<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">  
<!-- See https://developer.apple.com/business/documentation/Configuration-Profile-Reference.pdf for a full reference of the settings -->
<plist version="1.0">  
    <dict>  
          <key>PayloadContent</key>  
          <array>  
            <dict>  
              <key>PayloadDisplayName</key>  
              <string>SSO Settings</string>  
              <key>PayloadType</key>  
              <string>com.apple.sso</string>  
              <key>PayloadVersion</key>  
              <integer>1</integer>  
              <key>PayloadUUID</key>  
              <string>9F7C78AC-41F6-4474-8608-1EC41B6551B1</string>
              <key>PayloadIdentifier</key>  
              <string>analytics.spotfire.sso</string>  
              <key>Name</key> 
                <!-- Specify whatever name you'd like the profile to have -->
              <string>CONFIGURATION NAME</string>  
              <key>Kerberos</key>  
              <dict> 
                <key>PrincipalName</key>
                <!-- Optional. If nothing is specified here, you'll be prompt to enter a username when using the profile the first time -->
                <string>USERNAME</string>
                <key>Realm</key>  
                <!-- Replace DOMAIN.COM with your kerberos realm. Needs to be in all upper-case -->
                <string>DOMAIN.COM</string>  
                <key>URLPrefixMatches</key>  
                <array>
                    <!-- URL must start with either http:// or https:// -->
                    <string>http://spotfireserver.domain.com/</string>
                </array>  
                <key>AppIdentifierMatches</key>  
                <array>
                    <!-- The line below allows the TIBCO Spotfire® for Apple iOS App to use the profile -->
                    <string>com.tibco.spotfire.SpotfireForIPad</string>
                  <!-- Uncomment the line below if you want to allow Safari to also use the profile -->
                  <!-- <string>com.apple.mobilesafari</string> -->
                </array>  
              </dict>  
            </dict>  
          </array>  
        <key>PayloadDisplayName</key>
        <string>KerberosConfigProfile</string>
        <key>PayloadIdentifier</key>
        <string>local.analytics.ssoconfig</string>
        <key>PayloadOrganization</key>
        <!-- Optional. Here you can specify your organization name to be shown in the profile -->
        <string>ORGANISATION</string>
        <key>PayloadRemovalDisallowed</key>
        <false/>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>8C7EFBC0-B8C4-40EE-B3F6-CA1A8F068266</string>
        <key>PayloadVersion</key>
        <integer>1</integer> 
    </dict>
</plist>
